# 13: Konversi nilai numerik ke dalam sejumlah kategori

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    26
1    35
2    66
3    43
4    38
5    92
6    46
7    92
8    78
9    81

# Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [5]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    26        dewasa
1    35        dewasa
2    66        manula
3    43        dewasa
4    38        dewasa
5    92        manula
6    46        dewasa
7    92        manula
8    78        manula
9    81        manula